Лицензия MIT (на русском языке — те же условия, что и в LICENSE)

Copyright (c) 2026 LabsObjects
Создано и реализовано Фернандо Дантасом, Бразилия.

Настоящим любому лицу, получившему копию данного программного обеспечения
и сопутствующей документации (далее — «Программное обеспечение»), бесплатно
разрешается работать с Программным обеспечением без ограничений, включая,
без ограничения, права использовать, копировать, изменять, объединять,
публиковать, распространять, сублицензировать и/или продавать копии
Программного обеспечения, а также разрешать лицам, которым предоставляется
Программное обеспечение, делать это при соблюдении следующих условий:

Указанное выше уведомление об авторских правах и настоящее уведомление
о разрешении должны быть включены во все копии или существенные части
Программного обеспечения.

ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ «КАК ЕСТЬ», БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ,
ЯВНЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ГАРАНТИЯМИ ТОВАРНОЙ
ПРИГОДНОСТИ, ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ И НЕНАРУШЕНИЯ ПРАВ. НИ ПРИ КАКИХ
ОБСТОЯТЕЛЬСТВАХ АВТОРЫ ИЛИ ПРАВООБЛАДАТЕЛИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ПО КАКИМ-ЛИБО
ПРЕТЕНЗИЯМ, УЩЕРБУ ИЛИ ИНОЙ ОТВЕТСТВЕННОСТИ, ВОЗНИКАЮЩИМ ИЗ ДОГОВОРА, ДЕЛИКТА
ИЛИ ИНЫМ ОБРАЗОМ В СВЯЗИ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ ЛИБО ИСПОЛЬЗОВАНИЕМ ИЛИ
ИНЫМ ОБРАЩЕНИЕМ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ.
